; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-1-1-240)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-5 - location
	p6-0 - location
	p6-2 - location
	p2-3 - location
	p3-6 - location
	p5-3 - location
	p5-4 - location
	p1-2 - location
	p4-1 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s5)
	(at driver3 s1)
	(at driver4 s4)
	(at driver5 s4)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at package1 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 15)
	(= (time-to-walk p0-1 s0) 15)
	(= (time-to-walk s1 p0-1) 27)
	(= (time-to-walk p0-1 s1) 27)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 8)
	(= (time-to-walk p0-5 s0) 8)
	(= (time-to-walk s5 p0-5) 29)
	(= (time-to-walk p0-5 s5) 29)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 3)
	(= (time-to-walk p6-0 s6) 3)
	(= (time-to-walk s0 p6-0) 7)
	(= (time-to-walk p6-0 s0) 7)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 27)
	(= (time-to-walk p6-2 s6) 27)
	(= (time-to-walk s2 p6-2) 26)
	(= (time-to-walk p6-2 s2) 26)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 7)
	(= (time-to-walk p2-3 s2) 7)
	(= (time-to-walk s3 p2-3) 32)
	(= (time-to-walk p2-3 s3) 32)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 12)
	(= (time-to-walk p3-6 s3) 12)
	(= (time-to-walk s6 p3-6) 28)
	(= (time-to-walk p3-6 s6) 28)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 39)
	(= (time-to-walk p5-3 s5) 39)
	(= (time-to-walk s3 p5-3) 13)
	(= (time-to-walk p5-3 s3) 13)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 4)
	(= (time-to-walk p5-4 s5) 4)
	(= (time-to-walk s4 p5-4) 2)
	(= (time-to-walk p5-4 s4) 2)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 9)
	(= (time-to-walk p1-2 s1) 9)
	(= (time-to-walk s2 p1-2) 38)
	(= (time-to-walk p1-2 s2) 38)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 40)
	(= (time-to-walk p4-1 s4) 40)
	(= (time-to-walk s1 p4-1) 40)
	(= (time-to-walk p4-1 s1) 40)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 16)
	(= (time-to-drive s1 s3) 16)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 5)
	(= (time-to-drive s6 s3) 5)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 23)
	(= (time-to-drive s1 s4) 23)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 20)
	(= (time-to-drive s2 s4) 20)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 36)
	(= (time-to-drive s3 s4) 36)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 27)
	(= (time-to-drive s6 s4) 27)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 38)
	(= (time-to-drive s0 s2) 38)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 10)
	(= (time-to-drive s1 s2) 10)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 27)
	(= (time-to-drive s3 s2) 27)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 18)
	(= (time-to-drive s2 s5) 18)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 7)
	(= (time-to-drive s3 s5) 7)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 34)
	(= (time-to-drive s1 s6) 34)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 39)
	(= (time-to-drive s3 s0) 39)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 5)
	(= (time-to-drive s5 s0) 5)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 14)
	(= (time-to-drive s6 s0) 14)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s6)
	(at driver2 s4)
	(at driver4 s1)
	(at driver5 s5)
	(at truck1 s1)
	(at package1 s0)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver2 truck1 s5)
   deleted: (at driver2 s5) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 6
2. (walk driver5 s4 p5-4)
   deleted: (at driver5 s4)
   added: (at driver5 p5-4)
   goals met: 1 of 6
3. (walk driver5 p5-4 s5)
   deleted: (at driver5 p5-4)
   added: (at driver5 s5)
   goals met: 2 of 6
4. (load-truck package1 truck1 s5)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 6
5. (drive-truck truck1 s5 s3 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 0 to 77
   goals met: 2 of 6
6. (drive-truck truck1 s3 s4 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 77 to 473
   goals met: 2 of 6
7. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 3 of 6
8. (board-truck driver4 truck1 s4)
   deleted: (at driver4 s4) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 6
9. (drive-truck truck1 s4 s1 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 473 to 726
   goals met: 4 of 6
10. (disembark-truck driver4 truck1 s1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s1) (empty truck1)
   goals met: 5 of 6
11. (board-truck driver3 truck1 s1)
   deleted: (at driver3 s1) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 5 of 6
12. (drive-truck truck1 s1 s3 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 726 to 902
   goals met: 4 of 6
13. (drive-truck truck1 s3 s0 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 902 to 1331
   goals met: 4 of 6
14. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 6
15. (drive-truck truck1 s0 s6 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (fuel-used) from 1331 to 1471
   goals met: 5 of 6
16. (drive-truck truck1 s6 s1 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (fuel-used) from 1471 to 1811
   goals met: 6 of 6
